nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]
  - [-1, 1, Conv,  [128, 3, 2]]
  - [-1, 1, Conv,  [256, 3, 2]]
  - [-1, 1, Conv,  [512, 3, 2]]
  - [-1, 1, DINO3Backbone, ['dinov3_convnext_base', True, 512]] # DINO3 ConvNeXt Base
  - [-1, 1, Conv,  [512, 3, 1]]
  - [-1, 1, Conv,  [1024, 3, 2]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, Conv, [512, 1, 1]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, Conv, [512, 3, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, Conv, [512, 3, 1]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, Conv, [1024, 3, 1]]
  - [[14, 17, 20], 1, Detect, [nc]]