# YOLOv13s with DINO2 - Small variant for balanced speed and accuracy with enhanced features
# Usage: YOLO('yolov13-dino2-working-s.yaml')

nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]   # Small

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 1, DINO2Backbone, ['dinov2_vitb14', True, 512]] # 4-DINO2 integration
  - [-1, 2, DSC3k2,  [512, False, 0.25]]
  - [-1, 1, DSConv,  [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv,  [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9

head:
  - [[5, 7, 9], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ 10, 1, DownsampleConv, []]
  - [[7, 10], 1, FullPAD_Tunnel, []]  #13     
  - [[5, 11], 1, FullPAD_Tunnel, []]  #14    
  - [[9, 12], 1, FullPAD_Tunnel, []] #15 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Conv, [128, 3, 1]] # 21 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [256, 3, 1]] # 24 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P5
  - [-1, 1, Conv, [512, 3, 1]] # 27 (P5/32-large)

  - [[21, 24, 27], 1, Detect, [nc]] # Detect(P3, P4, P5)