nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  # Conventional CNN backbone similar to original YOLOv13 but with DINO2 features
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 1, DINO2Backbone, ['dinov2_vitb14', True, [512]]] # 6: DINO2 enhanced features
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [10, 1, DownsampleConv, []] # 11
  - [[6, 11], 1, FullPAD_Tunnel, []] # 12     
  - [[4, 10], 1, FullPAD_Tunnel, []] # 13    
  - [[8, 9], 1, FullPAD_Tunnel, []] # 14 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 12], 1, Concat, [1]] # 16
  - [-1, 2, DSC3k2, [512, True]] # 17
  - [[-1, 11], 1, FullPAD_Tunnel, []] # 18

  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 13], 1, Concat, [1]] # 20
  - [-1, 2, DSC3k2, [256, True]] # 21
  - [10, 1, Conv, [256, 1, 1]] # 22
  - [[21, 22], 1, FullPAD_Tunnel, []] # 23
  
  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 18], 1, Concat, [1]] # 25
  - [-1, 2, DSC3k2, [512, True]] # 26
  - [[-1, 11], 1, FullPAD_Tunnel, []] # 27

  - [26, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 14], 1, Concat, [1]] # 29
  - [-1, 2, DSC3k2, [1024,True]] # 30
  - [[-1, 9], 1, FullPAD_Tunnel, []] # 31
  
  - [[23, 27, 31], 1, Detect, [nc]] # 32